Repository: RegioneER/rer.solrpush
Catalog: src/rer/solrpush/locales/*/LC_MESSAGES/rer.solrpush.po
Languages: it

source: A complete list of keywords stored in SOLR.
it: La lista completa di parole chiave memorizzate in SOLR.

source: A complete list of portal_types stored in SOLR.
it: Una lista dei portal-types memorizzati su SOLR.

source: A list of (SOLR indexed) sites where search items.
it: Una lista di siti (indicizzati su SOLR) dove eseguire le ricerche.

source: Active
it: Attivo

source: Cancel
it: Annulla

source: Changes saved.
it: Modifiche salvate.

source: Elevate configuration
it: Configurazione Elevate

source: Enable SOLR indexing on this site.
it: Abilita l'indicizzazione con SOLR su questo sito.

source: Extra fields for Solr indexing
it: Campi extra per SOLR

source: Force commit
it: Forza il commit

source: Force commits on CRUD operations. If enabled, each indexing operation to SOLR will be immediately committed and persisted. This means that updates are immediately available on SOLR queries.If you are using SolrCloud with ZooKeeper, immediate commits will slow down response performances when indexing, so it's better to turn it off. In this case updates will be available when SOLR periodically commit changes.
it: Forza il commit nelle operazioni di CRUD. Se abilitato, ogni operazione di indicizzazione su SOLR viene committata all'istante. Questo significa che gli aggiornamenti sono immediatamente visibili nelle query su SOLR. Se stai usando SOLRCloud con ZooKeeper, i commit immediati possono rallentare abbastanza i tempi di risposta, quindi è meglio disattivarli. In questo caso gli aggiornamenti saranno disponibili dopo un certo tempo in cui SOLR in autonomia esegue il commit delle modifiche.

source: Frontend url
it: Url di frontend

source: Go back
it: Torna indietro

source: If enabled, when a search to SOLR is performed (for example in Collection), the query will be showed in the page for debug. Only visible to Managers.
it: Se abilitato, quando viene effettuata una ricerca su SOLR (per esempio nelle Collezioni), la query viene mostrata in pagina per debug. Questa informazione è disponibile solo ai Manager del sito.

source: If the website has different URL for frontend users.
it: Se il sito ha un url differente per il frontend.

source: Installs the rer.solrpush add-on.
it: Installa l'add-on rer.solrpush.

source: Keywords in SOLR
it: Parole chiave su SOLR

source: Loaded schema.xml from SOLR
it: schema.xml caricato correttamente da SOLR

source: No SOLR url provided
it: Nessun url di connessione a SOLR fornito

source: Portal types in SOLR
it: Tipi di contenuto su SOLR

source: Query debug
it: Debug della query

source: RER: Solr push (uninstall)
it: RER: Solr push (disinstalla)

source: Ready
it: Pronto

source: Reload schema.xml
it: Ricarica schema.xml

source: Reloaded schema.xml from SOLR
it: Ricarica le informazioni di schema.xml da SOLR

source: SOLR push is ready to be used.
it: SOLR push è pronto per essere utilizzato.

source: SOLR url
it: Url di SOLR

source: Save
it: Salva

source: Search with Solr
it: Ricerca su solr

source: Sites
it: Siti

source: Solr Push Configuration
it: Configurazione Solr Push

source: Solr additional fields
it: Campi aggiuntivi di SOLR

source: The SOLR core to connect to.
it: Il core di SOLR a cui connettersi.

source: Uninstalls the rer.solrpush add-on.
it: Disinstalla l'add-on rer.solrpush.

source: bf_help
it: Imposta una serie di funzioni (con boost opzionale) che verranno usate per costruire FunctionQueries aggiuntive alla query principale come clausole opzionali per influenzare lo score finale. Può essere usata qualsiasi funzione supportata da Solr. Per esempio se vogliamo dare meno rilevanza agli elementi più in basso nell'albero di navigazione, possiamo impostare qualcosa del genere: recip(path_depth,10,100,1)

source: bf_label
it: bf (boost functions)

source: bq_help
it: Imposta una lista di clausole aggiuntive alla query principale per influenzare lo score finale. Per esempio se vogliamo dare più rilevanza ai risultati che contengono uno specifico valore di "searchwords": searchwords:qualcosa^1000

source: bq_label
it: bq (boost query)

source: cancel_label
it: Annulla

source: content_indexed_error
it: Si è verificato un problema: questo contenuto non può essere indicizzato o rimosso da SOLR e quindi non verrà mostrato nelle ricerche e nelle collezioni fatte con SOLR. Avvisa subito gli amministratori del sito indicando l'URL di questo contenuto.

source: content_remove_error
it: Si è verificato un problema rimuovendo questo contenuto da SOLR. Contatta l'amministratore per maggiori informazioni.

source: elevate_row_schema_text_help
it: La parola nella chiave di ricerca necessaria ad elevare determinati contenuti tra i risultati.

source: elevate_row_schema_text_label
it: Testo

source: elevate_row_schema_uid_help
it: Seleziona una lista di contenuti del sito da elevare.

source: elevate_row_schema_uid_label
it: Elementi

source: elevate_schema_help
it: Inserisci una lista di valori per l'elevate.

source: elevate_schema_label
it: Configurazione Elevate

source: enabled_types_help
it: Scegli i tipi di contenuto da indicizzare su SOLR. Una lista vuota significa che tutti i tipi di contenuto verranno indicizzati.

source: enabled_types_label
it: Tipi di contenuto

source: go_to_controlpanel
it: Ritorna alla configurazione

source: help_searchwords
it: Specifica le parole per cui questo elemento verrà mostrato tra i primi risultati della ricerca. Inserisci una parola per riga.

source: index_fields_help
it: Ci salviamo questa lista per motivi di performance. Se la configurazione cambia, bisogna cliccare sul bottone di Aggiornamento.

source: index_fields_label
it: Lista di indici di SOLR che utilizziamo per fare l'inidicizzazione.

source: label_searchwords
it: Parole di ricerca

source: label_showinsearch
it: Mostra nella ricerca

source: maintenance_cancel_action
it: Azione annullata

source: maintenance_reindex_help
it: Recupera tutti i contenuti da Plone e reindicizzali su SOLR.

source: maintenance_reindex_label
it: Reindicizza SOLR

source: maintenance_reset_solr_description
it: Rmuovi tutti gli elementi dall'indice SOLR.

source: maintenance_reset_solr_label
it: Azzera l'indice SOLR

source: maintenance_reset_success
it: Indice SOLR azzerato

source: maintenance_sync_help
it: Rimuove da SOLR gli elementi non più presenti su Plone, e fa il sync con Plone

source: maintenance_sync_label
it: Sincronizza SOLR

source: qf_help
it: Imposta una lista di campi, ad ognuno dei quali verrà assegnato un fattore di incremento o decremento per la rilevanza nei risultati della ricerca. Per esempio "fieldOne^1000.0 fieldTwo fieldThree^10.0" assegna più importanza ai risultati che hanno la parola cercata nel fieldOne.

source: qf_label
it: qf (query fields)

source: reindex_solr_not_active
it: SOLR push non è attivo. Impossibile sincronizzarsi.

source: remote_elevate_help
it: Se questo campo è compilato e non è stato passato nessun valore per "site_name" nella query, allora lo schema per l'elevate verrà letto dall'url impostato. Questo è utile quando vengono indicizzati più siti, ma si vuole mantenere un elevate centrale. L'url deve essere un link che punta alla vista "@elevate-schema". Per esempio http://my-site.com/@elevate-schema.

source: remote_elevate_label
it: Elevate remoto

source: search_error_label
it: Impossibile eseguire la ricerca su SOLR. Contatta l'amministratore del sito o riprova tra qualche minuto.

source: settings_default_label
it: Impostazioni

source: settings_form_error
it: Sono presenti degli errori, si prega di ricontrollare i dati inseriti

source: settings_search_help
it: Utilizza questi campi per alterare i risultati delle ricerche.

source: settings_search_label
it: Ricerca

source: solr_configuration_error_label
it: Impossibile cercare usando SOLR. Configurazione incompleta o errata.

source: solr_elevate_configuration_label
it: Configurazione Elevate per Solr Push

source: solr_error_connection
it: Si è verificato un problema di connessione verso SOLR. Contatta l'amministratore per maggiori informazioni.

source: start_label
it: Avvia

source: text_duplicated_label
it: "${text}" è presente in più gruppi.

source: text_required_label
it: Il campo "testo" deve essere compilato per il gruppo ${id}.
